app/views/products/index.html.erb

SELECT `products`.* FROM `products`
---
	<%= turbo_frame_tag :products, class:"flex flex-col m-2" do %>
		<%= turbo_frame_tag "products-#{@pagy.page}", class: 'products flex flex-col w-full sm:flex-row sm:flex-wrap sm:gap-x-2' do %>